# -- coding: utf-8 --
# Задача 2

stroka = input("Введите строку: ")
a = stroka.count(" ")
print("Слов в строке: ", a+1)