# -- coding: utf-8 --

#Задача 6

x = int(input("Введите икс "))
y = int(input("Введите игрик "))
x, y = y, x
print(x,y)