# -- coding: utf-8 --

#Задача 7

number = int(input("Введите число "))
if number % 2 == 0:
    print("Число четное")
else:
    print("Число нечетное")