# -- coding: utf-8 --
#2 Задача

X = input("Действительное чисто: ")
b = (X.split("."))[1]
print("Дробная часть: ", b, )
#i
print("Первая цифра после дес. точки: " + b[0])

print("\n")