# -- coding: utf-8 --
#3 задача

print("Ввод должен быть выполнен в 24-часовом формате")
a , b , c = int(input("Часы первого момента: ")), int(input("Минуты первого момента: ")), int(input("Секунды первого момента: "))

a2, b2 , c2 = int(input("Часы второго момента: " )), int(input("Минуты второго момента: ")), int(input("Секунды второго момента: "))

h = a
h2 = a2
if h >= 13:
    h = h % 12
if h2 >= 13:
    h2 = h2 % 12
    
sec_all1 = ((h*3600) + (b*60) + c)
sec_all2 = ((h2*3600) + (b2*60) + c2)

if (23 >= a >= 0) and (60 >= b >= 0) and (60 >= c >= 0) and (23 >= a2 >= 0) and (60 >= b2 >= 0) and (60 >= c2 >= 0) and sec_all1 <= sec_all2:
    if sec_all1 == sec_all2:
        seconds = 0
        print("Число секунд между моментами: ", seconds)
    else:
        seconds = sec_all2 - sec_all1 
        print("Число секунд между моментами: ", seconds)
else:
    print("Ввод должен осуществлятся в 24-часовом формате, и время первого момента должно быть меньше, чем время второго")    

print("\n")